package sample;

import java.io.*;

/**
 * Created by AlekseiSamoilov on 06.12.15.
 */
public class Printer {
    public void printer(String printText){
        try {
            FileWriter writer = new FileWriter("text.txt");
            BufferedWriter writer2 = new BufferedWriter(writer);
            String finalCheck  = "********************************************************************************* \n"
                                +"*                                                                               * \n"
                                +"*                           АВТОСЕРВИС ИП Терещенко Н.М.                        *\n"
                                +"*_______________________________________________________________________________*\n"
                                + "********************************************************************************\n"
                                + "                                                          Адрес: г. Пермь, ул    \n"
                                + "                                                          2-я Новгородская, 108   \n"
                                + "                                                          тел. 2-34-32-33      \n"
                                + "                                                          ИНН 593100955931  \n"
                                + "                                                          ОГРН 593100955931    \n"
                                + "                                                          Банковский счет:  \n"
                                + "                                                          № 4080281014977000588 \n"
                                + "                                 Квитанция - Договор                         \n"
                                + printText
                                + "\n"
                                +"********************************************************************************\n"
                                + "Исполнитель\n"
                                + "Подпись__________________________               \n"
                                + "\n"
                                + "Заказчик\n"
                                + "Подпись__________________________\n\n"
                                +"********************************************************************************";

            writer2.newLine();
            writer2.write(finalCheck);

            writer2.close();
            writer.close();

        } catch (IOException e) {
            e.printStackTrace();
        }


    }
}
